import React from "react";

const Decription = () => {
  return (
    <div className="wrapDescription">
      <h4>Основні характеристики Elf ​​Bar BC3000:</h4>
      <p>Кількість тяг: 3000</p>
      <p>Ємність акумулятора: 650 mAh</p>
      <p>Міцність нікотину: 5%</p>
      <p>Можливість підзарядки: можлива </p>
      <h5 className="peculiarities">Особливості:</h5>
      <ul>
        <li>оригінальний продукт</li>
        <li>можливість підзарядки</li>
        <li>
          акумулятор підтримує струм заряду 1А через порт USB Type-C у торці
        </li>
        <li>
          подвійна вертикальна спіраль забезпечує стабільно високу якість
          передачі смаку
        </li>
      </ul>
      <h6 className="attention">УВАГА!</h6>
      <span>
        Кількість затяжок, вказана виробником, є приблизною. Залежно від стилю
        ширяння цей параметр у різних користувачів може суттєво відрізнятися.
      </span>
    </div>
  );
};

export default Decription;
