import React from "react";
import "./MainAskQuestions.scss";
import Interactive from "./Interactive";

const MainAskQuestions = () => {
  const arr = [
    {
      header: `Яка відмінність між POD-системами та звичайними електронними
            сигаретами?`,
      description: `Однією з відмінностей між POD-системами та одноразовими
      електронними сигаретами є те, що POD-системи можна заряджати та
      використовувати кілька разів, тоді як одноразові електронні
      сигарети призначені для одноразового вживання та після
      використання їх потрібно викинути. Крім того, вибір смаків та
      потужностей може бути більш широким для POD-систем, а одноразові
      електронні сигарети частіше мають більш стійкий та насичений
      смак.`,
    },
    {
      header: `Який термін зберігання у одноразових електронних сигарет?`,
      description: `Зазвичай термін зберігання від одного до трьох років, залежно від виробника та умов зберігання.`,
    },
    {
      header: `Чи надовго вистачає однієї одноразової електронної сигарети?`,
      description: `Відповідь залежить від кількох факторів. Насамперед це технічні характеристики пристрою (ємність акумулятора та об'єм картриджа) та індивідуальний стиль паріння.
      Оноразки на 1500 тяг вистачає приблизно на 5 днів, на 4000 тяг - 10-14 днів.`,
    },
    {
      header: `Чи можна використовувати картриджі та POD-системи різних брендів?`,
      description: `Ні. Кожен виробник має власні картриджі з специфічними розмірами, кріпленнями.`,
    },
    {
      header: `Якщо є проблема з продуктом, як її можна вирішити?`,
      description: `Гарантія розповсюджується на pod-системи( акумулятори та зарядні пристрої). 
      В разі виникнення проблеми зв’яжіться з нашим менеджером, він допоможе з вирішенням проблеми.`,
    },
  ];
  return (
    <div className="wrapMainAsk">
      <h2>Інформація для клієнта</h2>
      <div className="wrapQuestion">
        <h3>Питання-Відповідь</h3>
        <div className="wrapInteractiveBlock">
          {arr.map((item, index) => (
            <Interactive
              key={index}
              header={item.header}
              description={item.description}
            />
          ))}
        </div>
        <div className="wrapConditionDelivery">
          <h3>Умови доставки</h3>
          <h4>Доставка до відділень Нової Пошти</h4>
          <span>
            Ми працюємо з кур’єрською службою Нова Пошта, що дозволяє нам
            забезпечувати доставку замовлень в найкоротші терміни. Ми докладаємо
            всіх зусиль, щоб наші клієнти отримували свої замовлення
            якнайшвидше.
            <br />
            За умови підтвердження менеджером замовлення до 13:00, ваші
            замовлення відправляються у той самий день. А завдяки нашій
            співпраці з кур’єрською службою Нова Пошта, ви маєте можливість
            отримати замовлення вже через 1-2 дні після відправки.
          </span>
        </div>
        <div className="wrapConditionDelivery">
          <h3>Умови оплати</h3>
          <h4>Оплата при отриманні</h4>
          <span>
            Щоб скористатися цією послугою, при оформленні замовлення вам
            потрібно буде обрати опцію "оплата при отриманні" та вказати
            відділення Нової пошти, на яке бажаєте отримати посилку. Крім того,
            вам необхідно буде мати при собі документ, що підтверджує вашу особу
            (паспорт або водійські права). <br />
            Якщо ви вирішили скористатися оплатою при отриманні на відділенні
            Нової пошти, зверніть увагу, що додатково до суми замовлення вам
            доведеться заплатити комісію пошти у розмірі 2% від суми переказу та
            20 грн за послуги переказу коштів.
          </span>
          <h4>Переказ на картку</h4>
          <span>
            Якщо ви обрали оплату переказом на карту, після оформлення
            замовлення з вами зв'яжеться наш менеджер для підтвердження
            замовлення та узгодження деталей оплати. Після цього вам буде
            надіслано реквізити нашої карти для здійснення оплати. Цей спосіб
            оплати зазвичай є досить швидким та зручним
          </span>
        </div>
        <div className="wrapConditionDelivery">
          <h3>Обмін та повернення</h3>
          <span>
            Якщо вам трапилась бракована продукція, ви маєте надіслати нам
            відео-підтвердження , щоб ми могли визначити проблему і
            запропонувати вам оптимальне рішення. <br />
            Якщо ви не задоволені своїм замовленням з інших причин, ми приймаємо
            повернення товарів протягом 14 днів з моменту отримання замовлення.
            В цьому випадку, товар повинен бути в оригінальній упаковці та не
            використовуватись. Повернення товару здійснюється за рахунок
            покупця. Зв'яжіться з нашою службою підтримки, щоб отримати
            інформацію про процедуру повернення та обміну. Ми зробимо все
            можливе, щоб зробити процес якомога більш комфортним для вас.
          </span>
        </div>
      </div>
    </div>
  );
};

export default MainAskQuestions;
